IDEA Open Model
ConnectionSetup.BracedSystem Property
Compatible with IDEA StatiCa Beta 20.0
 Consider the frame system as braced for stiffness calculation. Braced system reduces horizontal displacements.
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public bool BracedSystem { get; set; }
Public Property BracedSystem As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace